poc/results/x-cross/chaos/tidb-vm-6node-P-B-aa-rc-20260808T101720+0800-scenarioC7/fio-summary.txt
chaos-c7-contention: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=64
...
fio-3.19
Starting 4 processes
chaos-c7-contention: Laying out IO file (1 file / 2048MiB)
chaos-c7-contention: Laying out IO file (1 file / 2048MiB)
chaos-c7-contention: Laying out IO file (1 file / 2048MiB)
[...]

chaos-c7-contention: (groupid=0, jobs=4): err= 0: pid=11612: Sat Aug  8 12:17:38 2026
  write: IOPS=46.4k, BW=181MiB/s (190MB/s)(5449MiB/30034msec); 0 zone resets
    slat (nsec): min=1489, max=80934k, avg=63777.34, stdev=1365701.16
    clat (usec): min=216, max=109903, avg=5446.74, stdev=11997.97
     lat (usec): min=237, max=109911, avg=5510.62, stdev=12064.81
    clat percentiles (usec):
     |  1.00th=[  537],  5.00th=[  766], 10.00th=[  947], 20.00th=[ 1205],
     | 30.00th=[ 1467], 40.00th=[ 1827], 50.00th=[ 2409], 60.00th=[ 3130],
     | 70.00th=[ 3785], 80.00th=[ 4621], 90.00th=[ 6456], 95.00th=[19530],
     | 99.00th=[68682], 99.50th=[70779], 99.90th=[80217], 99.95th=[83362],
     | 99.99th=[96994]
   bw (  KiB/s): min=113368, max=309184, per=100.00%, avg=186060.98, stdev=10048.15, samples=236
   iops        : min=28342, max=77295, avg=46515.10, stdev=2512.02, samples=236
  lat (usec)   : 250=0.01%, 500=0.62%, 750=4.07%, 1000=7.20%
  lat (msec)   : 2=31.71%, 4=29.46%, 10=20.65%, 20=1.35%, 50=1.71%
  lat (msec)   : 100=3.23%, 250=0.01%
  cpu          : usr=1.19%, sys=8.51%, ctx=115865, majf=0, minf=48
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=0,1394998,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
  WRITE: bw=181MiB/s (190MB/s), 181MiB/s-181MiB/s (190MB/s-190MB/s), io=5449MiB (5714MB), run=30034-30034msec

Disk stats (read/write):
  sda: ios=11/1800989, merge=0/91482, ticks=16/1633903, in_queue=1633919, util=34.96%